/****************************************Copyright (c)****************************************************
**                            Guangzhou ZLGMCU Technology Co., LTD
**
**                                 http://www.zlgmcu.com
**
**      广州周立功单片机科技有限公司所提供的所有服务内容旨在协助客户加速产品的研发进度，在服务过程中所提供
**  的任何程序、文档、测试结果、方案、支持等资料和信息，都仅供参考，客户有权不使用或自行参考修改，本公司不
**  提供任何的完整性、可靠性等保证，若在客户使用过程中因任何原因造成的特别的、偶然的或间接的损失，本公司不
**  承担任何责任。
**                                                                        ——广州周立功单片机科技有限公司
**
**--------------File Info---------------------------------------------------------------------------------
** File name:           LPC8xx_Gpio.c
** Last modified Date:  2016-1-4
** Last Version:        V1.00
** Descriptions:        操作LPC824函数头文件
**
**--------------------------------------------------------------------------------------------------------
** Created By:           linshan wen 
** Created date:         2016-01-08
** Version:              1.0
** Descriptions:         First version
**
**--------------------------------------------------------------------------------------------------------
*/

/*********************************************************************************************************
** Function name:       GPIOInit
** Descriptions:        GPIO初始化
** input parameters:    无
** output parameters:   无
** Returned value:      无
*********************************************************************************************************/
extern void GPIOInit (void);

/*********************************************************************************************************
** 函数名称：SSP_Init
** 功能说明：初始化SPI
** 输入参数：无
** 输出参数：无
*********************************************************************************************************/
extern void  SSP_Init (void);

/*********************************************************************************************************
** 函数名称: SendRecv_Byte
** 函数功能：一次传输内部的单字节帧发送与接收
** 输入参数: 数据线上发送出的数据
** 输出参数: 数据线上接收到的数据
** 返 回 值：无
*********************************************************************************************************/
extern uint8_t SendRecv_Byte (uint8_t ucData);

/*********************************************************************************************************
** 函数名称: SendRecv_Start
** 函数功能：一次传输起始的单字节帧发送与接收
** 输入参数: 数据线上发送出的数据
** 输出参数: 数据线上接收到的数据
** 返 回 值：无
*********************************************************************************************************/
extern uint8_t SendRecv_Start (uint8_t ucData);

/*********************************************************************************************************
** 函数名称: SendRecv_Stop
** 函数功能：一次传输结束的单字节帧发送与接收
** 输入参数: 数据线上发送出的数据
** 输出参数: 数据线上接收到的数据
** 返 回 值：无
*********************************************************************************************************/
extern uint8_t SendRecv_Stop (uint8_t ucData);














